Show / Hide Table of Contents
Class CrossSectionParameter
Cross-section defined by parameters
Inheritance
System.Object
OpenObject
OpenElementId
CrossSection
CrossSectionParameter
Inherited Members
 CrossSection.Name
 CrossSection.CrossSectionRotation
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.CrossSection
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Libraries.CrossSection.CrossSection,CI.CrossSection", "CI.StructModel.Libraries.CrossSection.ICrossSection,CI.BasicTypes", typeof(CrossSection))]
public class CrossSectionParameter : CrossSection
Constructors
Improve this Doc   View Source
CrossSectionParameter()
Constructor
Declaration
public CrossSectionParameter()
Properties
Improve this Doc   View Source
CrossSectionType
Type of cross-section
Declaration
public CrossSectionType CrossSectionType { get; set; }
Property Value
 Type |  Description
 CrossSectionType
Improve this Doc   View Source
Material
Material
Declaration
public ReferenceElement Material { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
Parameters
Parameters
Declaration
public List<Parameter> Parameters { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<Parameter>
 Improve this Doc
 View Source